In [2]:
import seaborn as sns

iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [1]:
import pandas as pd
#pandas always work with Structured data like excel, sql

In [3]:
#pd.read_csv('filename.csv') - to read a csv file

In [4]:
type(iris)

pandas.core.frame.DataFrame

In [5]:
#2type of data in pandas - Series and DataFrame

In [7]:
#to get column names
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [8]:
list(iris.columns)

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [11]:
#to view sample data
iris.head(3) #first 3, default = 5 if no value is given
iris.tail(3) #last 3, default = 5
iris.sample(5) #5 randam rows

     sepal_length  sepal_width  petal_length  petal_width     species
123           6.3          2.7           4.9          1.8   virginica
22            4.6          3.6           1.0          0.2      setosa
38            4.4          3.0           1.3          0.2      setosa
7             5.0          3.4           1.5          0.2      setosa
88            5.6          3.0           4.1          1.3  versicolor

In [12]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [14]:
#to select columns
iris['sepal_length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [16]:
type(iris['sepal_length']) # this is a Series datatype of pandas

pandas.core.series.Series

In [19]:
list(iris['sepal_length'])[:5] # this will retrun list without the indexing

[5.1, 4.9, 4.7, 4.6, 5.0]

In [21]:
iris[['sepal_length']]
type(iris[['sepal_length']]) # if column is passed in a list, it'll return DataFrame dtype

pandas.core.frame.DataFrame

In [23]:
#for multicolumns, pass the columns in a list
iris[['sepal_length', 'sepal_width']], type(iris[['sepal_length', 'sepal_width']])

(     sepal_length  sepal_width
 0             5.1          3.5
 1             4.9          3.0
 2             4.7          3.2
 3             4.6          3.1
 4             5.0          3.6
 ..            ...          ...
 145           6.7          3.0
 146           6.3          2.5
 147           6.5          3.0
 148           6.2          3.4
 149           5.9          3.0

 [150 rows x 2 columns],
 pandas.core.frame.DataFrame)

In [24]:
#to read excel data
#pd.read_excel('filename.xlsx', sheetname = 'sheetname')

In [26]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [27]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
#to save data
df.to_csv('titanic.csv', index=False)

In [35]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 30.3 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
#to read html
import lxml
import pandas as pd # after pip intall, restart kernal
url_data =  pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

In [4]:
type(url_data)

list

In [5]:
len(url_data)

1

In [7]:
df1 = url_data[0]

In [8]:
df1.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [9]:
df1.dtypes

Rk        object
Player    object
Pos       object
Age       object
Tm        object
G         object
GS        object
MP        object
FG        object
FGA       object
FG%       object
3P        object
3PA       object
3P%       object
2P        object
2PA       object
2P%       object
eFG%      object
FT        object
FTA       object
FT%       object
ORB       object
DRB       object
TRB       object
AST       object
STL       object
BLK       object
TOV       object
PF        object
PTS       object
dtype: object

In [10]:
df1.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [12]:
df1['Rk'], df1[['Rk']]

(0        1
 1        2
 2        3
 3        4
 4        5
       ...
 670    490
 671    490
 672    490
 673    491
 674    492
 Name: Rk, Length: 675, dtype: object,
       Rk
 0      1
 1      2
 2      3
 3      4
 4      5
 ..   ...
 670  490
 671  490
 672  490
 673  491
 674  492

 [675 rows x 1 columns])

In [13]:
df1.to_csv('players.csv',index=False)